Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hsdramc.h
/**
 * \brief Component description for HSDRAMC
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-02-03T17:22:07Z */
#ifndef _SAMRH71_HSDRAMC_COMPONENT_H_
#define _SAMRH71_HSDRAMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HSDRAMC                                      */
/* ************************************************************************** */

/* -------- HSDRAMC_MR : (HSDRAMC Offset: 0x00) (R/W 32) Mode Register -------- */
#define HSDRAMC_MR_MODE_Pos                   _U_(0)                                               /**< (HSDRAMC_MR) SDRAMC Command Mode Position */
#define HSDRAMC_MR_MODE_Msk                   (_U_(0x7) << HSDRAMC_MR_MODE_Pos)                    /**< (HSDRAMC_MR) SDRAMC Command Mode Mask */
#define HSDRAMC_MR_MODE(value)                (HSDRAMC_MR_MODE_Msk & ((value) << HSDRAMC_MR_MODE_Pos))
#define   HSDRAMC_MR_MODE_NORMAL_Val          _U_(0x0)                                             /**< (HSDRAMC_MR) Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   HSDRAMC_MR_MODE_NOP_Val             _U_(0x1)                                             /**< (HSDRAMC_MR) The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   HSDRAMC_MR_MODE_ALLBANKS_PRECHARGE_Val _U_(0x2)                                             /**< (HSDRAMC_MR) The SDRAMC issues an "All Banks Precharge" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   HSDRAMC_MR_MODE_LOAD_MODEREG_Val    _U_(0x3)                                             /**< (HSDRAMC_MR) The SDRAMC issues a "Load Mode Register" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   HSDRAMC_MR_MODE_AUTO_REFRESH_Val    _U_(0x4)                                             /**< (HSDRAMC_MR) The SDRAMC issues an "Autorefresh" Command when the SDRAM device is accessed regardless of the cycle. Previously, an "All Banks Precharge" command must be issued. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   HSDRAMC_MR_MODE_EXT_LOAD_MODEREG_Val _U_(0x5)                                             /**< (HSDRAMC_MR) The SDRAMC issues an "Extended Load Mode Register" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the "Extended Load Mode Register" command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1.  */
#define HSDRAMC_MR_MODE_NORMAL                (HSDRAMC_MR_MODE_NORMAL_Val << HSDRAMC_MR_MODE_Pos)  /**< (HSDRAMC_MR) Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define HSDRAMC_MR_MODE_NOP                   (HSDRAMC_MR_MODE_NOP_Val << HSDRAMC_MR_MODE_Pos)     /**< (HSDRAMC_MR) The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define HSDRAMC_MR_MODE_ALLBANKS_PRECHARGE    (HSDRAMC_MR_MODE_ALLBANKS_PRECHARGE_Val << HSDRAMC_MR_MODE_Pos) /**< (HSDRAMC_MR) The SDRAMC issues an "All Banks Precharge" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define HSDRAMC_MR_MODE_LOAD_MODEREG          (HSDRAMC_MR_MODE_LOAD_MODEREG_Val << HSDRAMC_MR_MODE_Pos) /**< (HSDRAMC_MR) The SDRAMC issues a "Load Mode Register" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define HSDRAMC_MR_MODE_AUTO_REFRESH          (HSDRAMC_MR_MODE_AUTO_REFRESH_Val << HSDRAMC_MR_MODE_Pos) /**< (HSDRAMC_MR) The SDRAMC issues an "Autorefresh" Command when the SDRAM device is accessed regardless of the cycle. Previously, an "All Banks Precharge" command must be issued. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define HSDRAMC_MR_MODE_EXT_LOAD_MODEREG      (HSDRAMC_MR_MODE_EXT_LOAD_MODEREG_Val << HSDRAMC_MR_MODE_Pos) /**< (HSDRAMC_MR) The SDRAMC issues an "Extended Load Mode Register" command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the "Extended Load Mode Register" command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1. Position  */
#define HSDRAMC_MR_Msk                        _U_(0x00000007)                                      /**< (HSDRAMC_MR) Register Mask  */


/* -------- HSDRAMC_TR : (HSDRAMC Offset: 0x04) (R/W 32) Refresh Timer Register -------- */
#define HSDRAMC_TR_COUNT_Pos                  _U_(0)                                               /**< (HSDRAMC_TR) SDRAMC Refresh Timer Count Position */
#define HSDRAMC_TR_COUNT_Msk                  (_U_(0xFFF) << HSDRAMC_TR_COUNT_Pos)                 /**< (HSDRAMC_TR) SDRAMC Refresh Timer Count Mask */
#define HSDRAMC_TR_COUNT(value)               (HSDRAMC_TR_COUNT_Msk & ((value) << HSDRAMC_TR_COUNT_Pos))
#define HSDRAMC_TR_Msk                        _U_(0x00000FFF)                                      /**< (HSDRAMC_TR) Register Mask  */


