Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hsdramc.h
/* -------- HSDRAMC_IER : (HSDRAMC Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define HSDRAMC_IER_RES_Pos                   _U_(0)                                               /**< (HSDRAMC_IER) Refresh Error Interrupt Enable Position */
#define HSDRAMC_IER_RES_Msk                   (_U_(0x1) << HSDRAMC_IER_RES_Pos)                    /**< (HSDRAMC_IER) Refresh Error Interrupt Enable Mask */
#define HSDRAMC_IER_RES(value)                (HSDRAMC_IER_RES_Msk & ((value) << HSDRAMC_IER_RES_Pos))
#define HSDRAMC_IER_Msk                       _U_(0x00000001)                                      /**< (HSDRAMC_IER) Register Mask  */


/* -------- HSDRAMC_IDR : (HSDRAMC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define HSDRAMC_IDR_RES_Pos                   _U_(0)                                               /**< (HSDRAMC_IDR) Refresh Error Interrupt Disable Position */
#define HSDRAMC_IDR_RES_Msk                   (_U_(0x1) << HSDRAMC_IDR_RES_Pos)                    /**< (HSDRAMC_IDR) Refresh Error Interrupt Disable Mask */
#define HSDRAMC_IDR_RES(value)                (HSDRAMC_IDR_RES_Msk & ((value) << HSDRAMC_IDR_RES_Pos))
#define HSDRAMC_IDR_Msk                       _U_(0x00000001)                                      /**< (HSDRAMC_IDR) Register Mask  */


/* -------- HSDRAMC_IMR : (HSDRAMC Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define HSDRAMC_IMR_RES_Pos                   _U_(0)                                               /**< (HSDRAMC_IMR) Refresh Error Interrupt Mask Position */
#define HSDRAMC_IMR_RES_Msk                   (_U_(0x1) << HSDRAMC_IMR_RES_Pos)                    /**< (HSDRAMC_IMR) Refresh Error Interrupt Mask Mask */
#define HSDRAMC_IMR_RES(value)                (HSDRAMC_IMR_RES_Msk & ((value) << HSDRAMC_IMR_RES_Pos))
#define HSDRAMC_IMR_Msk                       _U_(0x00000001)                                      /**< (HSDRAMC_IMR) Register Mask  */


/* -------- HSDRAMC_ISR : (HSDRAMC Offset: 0x20) ( R/ 32) Interrupt Status Register -------- */
#define HSDRAMC_ISR_RES_Pos                   _U_(0)                                               /**< (HSDRAMC_ISR) Refresh Error Status (cleared on read) Position */
#define HSDRAMC_ISR_RES_Msk                   (_U_(0x1) << HSDRAMC_ISR_RES_Pos)                    /**< (HSDRAMC_ISR) Refresh Error Status (cleared on read) Mask */
#define HSDRAMC_ISR_RES(value)                (HSDRAMC_ISR_RES_Msk & ((value) << HSDRAMC_ISR_RES_Pos))
#define HSDRAMC_ISR_Msk                       _U_(0x00000001)                                      /**< (HSDRAMC_ISR) Register Mask  */


/* -------- HSDRAMC_CFR1 : (HSDRAMC Offset: 0x24) (R/W 32) Configuration Register 1 -------- */
#define HSDRAMC_CFR1_TMRD_Pos                 _U_(0)                                               /**< (HSDRAMC_CFR1) Load Mode Register Command to Active or Refresh Command Position */
#define HSDRAMC_CFR1_TMRD_Msk                 (_U_(0xF) << HSDRAMC_CFR1_TMRD_Pos)                  /**< (HSDRAMC_CFR1) Load Mode Register Command to Active or Refresh Command Mask */
#define HSDRAMC_CFR1_TMRD(value)              (HSDRAMC_CFR1_TMRD_Msk & ((value) << HSDRAMC_CFR1_TMRD_Pos))
#define HSDRAMC_CFR1_UNAL_Pos                 _U_(8)                                               /**< (HSDRAMC_CFR1) Support Unaligned Access Position */
#define HSDRAMC_CFR1_UNAL_Msk                 (_U_(0x1) << HSDRAMC_CFR1_UNAL_Pos)                  /**< (HSDRAMC_CFR1) Support Unaligned Access Mask */
#define HSDRAMC_CFR1_UNAL(value)              (HSDRAMC_CFR1_UNAL_Msk & ((value) << HSDRAMC_CFR1_UNAL_Pos))
#define   HSDRAMC_CFR1_UNAL_UNSUPPORTED_Val   _U_(0x0)                                             /**< (HSDRAMC_CFR1) Unaligned access is not supported.  */
#define   HSDRAMC_CFR1_UNAL_SUPPORTED_Val     _U_(0x1)                                             /**< (HSDRAMC_CFR1) Unaligned access is supported.  */
#define HSDRAMC_CFR1_UNAL_UNSUPPORTED         (HSDRAMC_CFR1_UNAL_UNSUPPORTED_Val << HSDRAMC_CFR1_UNAL_Pos) /**< (HSDRAMC_CFR1) Unaligned access is not supported. Position  */
#define HSDRAMC_CFR1_UNAL_SUPPORTED           (HSDRAMC_CFR1_UNAL_SUPPORTED_Val << HSDRAMC_CFR1_UNAL_Pos) /**< (HSDRAMC_CFR1) Unaligned access is supported. Position  */
#define HSDRAMC_CFR1_Msk                      _U_(0x0000010F)                                      /**< (HSDRAMC_CFR1) Register Mask  */


/* -------- HSDRAMC_WPMR : (HSDRAMC Offset: 0x28) (R/W 32) Write Protection Mode Register -------- */
#define HSDRAMC_WPMR_WPEN_Pos                 _U_(0)                                               /**< (HSDRAMC_WPMR) Write Protection Enable Position */
#define HSDRAMC_WPMR_WPEN_Msk                 (_U_(0x1) << HSDRAMC_WPMR_WPEN_Pos)                  /**< (HSDRAMC_WPMR) Write Protection Enable Mask */
#define HSDRAMC_WPMR_WPEN(value)              (HSDRAMC_WPMR_WPEN_Msk & ((value) << HSDRAMC_WPMR_WPEN_Pos))
#define HSDRAMC_WPMR_WPKEY_Pos                _U_(8)                                               /**< (HSDRAMC_WPMR) Write Protection Key Position */
#define HSDRAMC_WPMR_WPKEY_Msk                (_U_(0xFFFFFF) << HSDRAMC_WPMR_WPKEY_Pos)            /**< (HSDRAMC_WPMR) Write Protection Key Mask */
#define HSDRAMC_WPMR_WPKEY(value)             (HSDRAMC_WPMR_WPKEY_Msk & ((value) << HSDRAMC_WPMR_WPKEY_Pos))
#define   HSDRAMC_WPMR_WPKEY_PASSWD_Val       _U_(0x534452)                                        /**< (HSDRAMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define HSDRAMC_WPMR_WPKEY_PASSWD             (HSDRAMC_WPMR_WPKEY_PASSWD_Val << HSDRAMC_WPMR_WPKEY_Pos) /**< (HSDRAMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define HSDRAMC_WPMR_Msk                      _U_(0xFFFFFF01)                                      /**< (HSDRAMC_WPMR) Register Mask  */


/* -------- HSDRAMC_WPSR : (HSDRAMC Offset: 0x2C) ( R/ 32) Write Protection Status Register -------- */
#define HSDRAMC_WPSR_WPVS_Pos                 _U_(0)                                               /**< (HSDRAMC_WPSR) Write Protection Violation Status Position */
#define HSDRAMC_WPSR_WPVS_Msk                 (_U_(0x1) << HSDRAMC_WPSR_WPVS_Pos)                  /**< (HSDRAMC_WPSR) Write Protection Violation Status Mask */
#define HSDRAMC_WPSR_WPVS(value)              (HSDRAMC_WPSR_WPVS_Msk & ((value) << HSDRAMC_WPSR_WPVS_Pos))
#define HSDRAMC_WPSR_WPVSRC_Pos               _U_(8)                                               /**< (HSDRAMC_WPSR) Write Protection Violation Source Position */
#define HSDRAMC_WPSR_WPVSRC_Msk               (_U_(0xFF) << HSDRAMC_WPSR_WPVSRC_Pos)               /**< (HSDRAMC_WPSR) Write Protection Violation Source Mask */
#define HSDRAMC_WPSR_WPVSRC(value)            (HSDRAMC_WPSR_WPVSRC_Msk & ((value) << HSDRAMC_WPSR_WPVSRC_Pos))
#define HSDRAMC_WPSR_Msk                      _U_(0x0000FF01)                                      /**< (HSDRAMC_WPSR) Register Mask  */


/** \brief HSDRAMC register offsets definitions */
#define HSDRAMC_MR_REG_OFST            (0x00)              /**< (HSDRAMC_MR) Mode Register Offset */
#define HSDRAMC_TR_REG_OFST            (0x04)              /**< (HSDRAMC_TR) Refresh Timer Register Offset */
#define HSDRAMC_CR_REG_OFST            (0x08)              /**< (HSDRAMC_CR) Configuration Register Offset */
#define HSDRAMC_SDR_REG_OFST           (0x0C)              /**< (HSDRAMC_SDR) Setup Delay Register Offset */
#define HSDRAMC_IER_REG_OFST           (0x14)              /**< (HSDRAMC_IER) Interrupt Enable Register Offset */
#define HSDRAMC_IDR_REG_OFST           (0x18)              /**< (HSDRAMC_IDR) Interrupt Disable Register Offset */
#define HSDRAMC_IMR_REG_OFST           (0x1C)              /**< (HSDRAMC_IMR) Interrupt Mask Register Offset */
#define HSDRAMC_ISR_REG_OFST           (0x20)              /**< (HSDRAMC_ISR) Interrupt Status Register Offset */
#define HSDRAMC_CFR1_REG_OFST          (0x24)              /**< (HSDRAMC_CFR1) Configuration Register 1 Offset */
#define HSDRAMC_WPMR_REG_OFST          (0x28)              /**< (HSDRAMC_WPMR) Write Protection Mode Register Offset */
#define HSDRAMC_WPSR_REG_OFST          (0x2C)              /**< (HSDRAMC_WPSR) Write Protection Status Register Offset */

