Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/hsdramc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief HSDRAMC register API structure */
typedef struct
{
  __IO  uint32_t                       HSDRAMC_MR;         /**< Offset: 0x00 (R/W  32) Mode Register */
  __IO  uint32_t                       HSDRAMC_TR;         /**< Offset: 0x04 (R/W  32) Refresh Timer Register */
  __IO  uint32_t                       HSDRAMC_CR;         /**< Offset: 0x08 (R/W  32) Configuration Register */
  __IO  uint32_t                       HSDRAMC_SDR;        /**< Offset: 0x0C (R/W  32) Setup Delay Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   uint32_t                       HSDRAMC_IER;        /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       HSDRAMC_IDR;        /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       HSDRAMC_IMR;        /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       HSDRAMC_ISR;        /**< Offset: 0x20 (R/   32) Interrupt Status Register */
  __IO  uint32_t                       HSDRAMC_CFR1;       /**< Offset: 0x24 (R/W  32) Configuration Register 1 */
  __IO  uint32_t                       HSDRAMC_WPMR;       /**< Offset: 0x28 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       HSDRAMC_WPSR;       /**< Offset: 0x2C (R/   32) Write Protection Status Register */
} hsdramc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_HSDRAMC_COMPONENT_H_ */
